#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.cloudsetup: Reading...
tls_private_key.private_key: Refreshing state... [id=4fe5e367fc35d3d7530e447dac4435116ad8855e]
data.http.cloudflare_ips: Reading...
data.http.cloudflare_ips: Read complete after 0s [id=https://api.cloudflare.com/client/v4/ips]
aws_cloudfront_public_key.public_key: Refreshing state... [id=K1S1EKKX3D9LTG]
data.aws_iam_policy.xray: Reading...
aws_api_gateway_rest_api.api: Refreshing state... [id=t1grcsbqx4]
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
data.aws_kms_key.generic: Reading...
data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
aws_ssm_parameter.private_key: Refreshing state... [id=/cloudfront/signer/private_key]
data.aws_region.current: Read complete after 0s [id=eu-west-1]
data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=3693445097]
aws_iam_role.get_cookies: Refreshing state... [id=get_cookies]
data.aws_caller_identity.current: Read complete after 0s [id=075673041815]
data.aws_kms_key.generic: Read complete after 0s [id=8a8fde17-57c1-44bd-8e43-c1d8a87f3b88]
aws_cloudwatch_log_group.get_cookies: Refreshing state... [id=/aws/lambda/get-cookies]
aws_api_gateway_resource.api: Refreshing state... [id=2u9kza]
aws_cloudwatch_log_group.api: Refreshing state... [id=/aws/apigateway/get-cookies]
data.aws_iam_policy_document.api: Reading...
data.aws_iam_policy_document.api: Read complete after 0s [id=1206294206]
aws_api_gateway_rest_api_policy.api: Refreshing state... [id=t1grcsbqx4]
aws_api_gateway_method.api: Refreshing state... [id=agm-t1grcsbqx4-2u9kza-GET]
data.terraform_remote_state.cloudsetup: Read complete after 1s
aws_cognito_user_pool_client.get_cookies: Refreshing state... [id=3s2qppa564nr44e2igdkb40qq7]
aws_s3_object.get_cookies: Refreshing state... [id=get_cookies/lambda.zip]
data.aws_iam_policy_document.get_cookies: Reading...
data.aws_iam_policy_document.get_cookies: Read complete after 0s [id=613733283]
aws_iam_role_policy.get_cookies: Refreshing state... [id=get_cookies:get_cookies]
data.aws_iam_policy.xray: Read complete after 1s [id=arn:aws:iam::aws:policy/AWSXRayDaemonWriteAccess]
aws_iam_role_policy_attachment.get_cookies_xray: Refreshing state... [id=get_cookies-20220711123407978400000001]
aws_lambda_function.get_cookies: Refreshing state... [id=get-cookies]
aws_lambda_permission.get_cookies: Refreshing state... [id=AllowAuthAPIInvoke]
aws_api_gateway_integration.api: Refreshing state... [id=agi-t1grcsbqx4-2u9kza-GET]
aws_api_gateway_deployment.api: Refreshing state... [id=hi9dad]
aws_api_gateway_stage.prod: Refreshing state... [id=ags-t1grcsbqx4-prod]
aws_api_gateway_base_path_mapping.api: Refreshing state... [id=api.mdekort.nl/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.get_cookies will be updated in-place
  ~ resource "aws_lambda_function" "get_cookies" {
        id                             = "get-cookies"
      ~ last_modified                  = "2023-02-25T09:10:16.000+0000" -> (known after apply)
      ~ s3_object_version              = "wWVvqFA_f_ltoO2cXT6mfHnYER0mOnPP" -> (known after apply)
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.get_cookies will be updated in-place
  ~ resource "aws_s3_object" "get_cookies" {
        id                     = "get_cookies/lambda.zip"
      ~ source_hash            = "066d2f986997efeddfbae7bcfec4d1c8" -> "691e7ed697a72ffe9a2d21c5eea66d6f"
        tags                   = {}
      ~ version_id             = "wWVvqFA_f_ltoO2cXT6mfHnYER0mOnPP" -> (known after apply)
        # (13 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dependabot[bot], Action: `pull_request`*